--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/mshams/Dropbox/Courses/are256b-w26/log/week5_5Feb2026.log
  log type:  text
 opened on:   5 Feb 2026, 22:55:46

. 
. * Load your dataset
. import delimited "$path/data/broiler.csv", clear
(encoding automatically selected: ISO-8859-1)
(12 vars, 40 obs)

. 
. ******************************************************************************
> **
. 
. browse

. 
. /*
> "y" is perÂ­capita real disposable income, 
> "pchick" stands for "price of chicken", 
> "pbeef" is "price of beef", 
> "pcor" is "price of corn", 
> "pf" is "price of chicken feed", 
> "cpi" is "consumer price index", 
> "qproda" is "aggregate production of chicken in pounds", 
> "pop" is "population of the US", a
> nd "meatex" is "exports of beef, veal, and pork in pounds".
> */
. 
. * OLS regressions
. reg q pchick // short regression 

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(1, 38)        =    667.75
       Model |  3616.86534         1  3616.86534   Prob > F        =    0.0000
    Residual |  205.825702        38  5.41646586   R-squared       =    0.9462
-------------+----------------------------------   Adj R-squared   =    0.9447
       Total |  3822.69105        39  98.0177191   Root MSE        =    2.3273

------------------------------------------------------------------------------
           q | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      pchick |   .2515834   .0097358    25.84   0.000     .2318742    .2712926
       _cons |   10.19811   .9859519    10.34   0.000     8.202155    12.19407
------------------------------------------------------------------------------

. reg q pchick y pop cpi meatex pbeef // long regression 

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(6, 33)        =    595.01
       Model |   3787.6792         6  631.279866   Prob > F        =    0.0000
    Residual |  35.0118479        33  1.06096509   R-squared       =    0.9908
-------------+----------------------------------   Adj R-squared   =    0.9892
       Total |  3822.69105        39  98.0177191   Root MSE        =      1.03

------------------------------------------------------------------------------
           q | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      pchick |  -.1964983   .0423821    -4.64   0.000    -.2827254   -.1102712
           y |   .0020403   .0006204     3.29   0.002     .0007782    .0033024
         pop |  -.1193832   .1067895    -1.12   0.272    -.3366481    .0978817
         cpi |   .1244079   .0344126     3.62   0.001     .0543949    .1944209
      meatex |   .0082703   .0016866     4.90   0.000     .0048388    .0117018
       pbeef |   .0839835   .0336767     2.49   0.018     .0154677    .1524992
       _cons |   26.01133   14.72244     1.77   0.087    -3.941704    55.96437
------------------------------------------------------------------------------

. 
. /* Recall the OVB formula:
> 
> OVB = \beta_long - \beta_short = \Sigma_j \Gamma_j Cov(W_j,X)/var(X)
> 
> let's see what explains the difference between the two betas */
. 
. reg y pchick 

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(1, 38)        =    688.16
       Model |   592215061         1   592215061   Prob > F        =    0.0000
    Residual |  32701891.3        38  860576.086   R-squared       =    0.9477
-------------+----------------------------------   Adj R-squared   =    0.9463
       Total |   624916952        39  16023511.6   Root MSE        =    927.67

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      pchick |   101.8018   3.880703    26.23   0.000     93.94575    109.6579
       _cons |   6431.989   392.9998    16.37   0.000     5636.403    7227.576
------------------------------------------------------------------------------

. reg pop pchick

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(1, 38)        =    920.30
       Model |  29541.9581         1  29541.9581   Prob > F        =    0.0000
    Residual |   1219.8071        38  32.1001869   R-squared       =    0.9603
-------------+----------------------------------   Adj R-squared   =    0.9593
       Total |  30761.7652        39  788.763209   Root MSE        =    5.6657

------------------------------------------------------------------------------
         pop | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      pchick |   .7190109   .0237012    30.34   0.000     .6710304    .7669914
       _cons |   159.8726   2.400223    66.61   0.000     155.0136    164.7316
------------------------------------------------------------------------------

. reg cpi pchick

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(1, 38)        =   1697.79
       Model |  86757.2472         1  86757.2472   Prob > F        =    0.0000
    Residual |  1941.80903        38  51.1002376   R-squared       =    0.9781
-------------+----------------------------------   Adj R-squared   =    0.9775
       Total |  88699.0562        39  2274.33477   Root MSE        =    7.1484

------------------------------------------------------------------------------
         cpi | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      pchick |   1.232165   .0299039    41.20   0.000     1.171627    1.292702
       _cons |  -31.02244   3.028372   -10.24   0.000    -37.15306   -24.89182
------------------------------------------------------------------------------

. reg meatex pchick

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(1, 38)        =    130.72
       Model |  6469262.78         1  6469262.78   Prob > F        =    0.0000
    Residual |   1880588.6        38  49489.1736   R-squared       =    0.7748
-------------+----------------------------------   Adj R-squared   =    0.7688
       Total |  8349851.38        39  214098.753   Root MSE        =    222.46

------------------------------------------------------------------------------
      meatex | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      pchick |   10.64004   .9306169    11.43   0.000     8.756104    12.52397
       _cons |  -608.0333   94.24381    -6.45   0.000    -798.8199   -417.2466
------------------------------------------------------------------------------

. reg pbeef pchick

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(1, 38)        =    841.08
       Model |  58430.2112         1  58430.2112   Prob > F        =    0.0000
    Residual |  2639.88743        38  69.4707218   R-squared       =    0.9568
-------------+----------------------------------   Adj R-squared   =    0.9556
       Total |  61070.0986        39  1565.89997   Root MSE        =    8.3349

------------------------------------------------------------------------------
       pbeef | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      pchick |   1.011194   .0348672    29.00   0.000     .9406092    1.081779
       _cons |  -11.45922   3.531007    -3.25   0.002    -18.60737   -4.311068
------------------------------------------------------------------------------

. 
. /* --> we use pcor or pfeed as an instrument! */
. 
. /*Refresher on instruments, out good friend for demand estimation! 
> 
> 1) Validity: cov(u,Z) = 0.
> 
> in demand estimation u are all the unobservable factors that affect the demand
>  ... 
> "demand-shifters", "taste", ...
> 
> 2) Relvance: cov(X,Z) not 0.
> 
> instrument should affect the endogenuous variable 
> 
> 3) Exclusion: Z has no direct link with Y.
> 
> Simply the fact that instrument should be "excluded exogenuous variable" */
. 
. 
. * IV regression
. 
. ivregress 2sls q (pchick = pf) y pop cpi pbeef meatex

Instrumental-variables 2SLS regression            Number of obs   =         40
                                                  Wald chi2(6)    =    3944.66
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.9900
                                                  Root MSE        =     .97926

------------------------------------------------------------------------------
           q | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      pchick |  -.2717676   .0629364    -4.32   0.000    -.3951207   -.1484144
           y |   .0027603   .0007495     3.68   0.000     .0012913    .0042292
         pop |  -.2281387   .1232373    -1.85   0.064    -.4696794    .0134019
         cpi |   .1530165   .0375239     4.08   0.000      .079471    .2265621
       pbeef |   .1070905   .0352898     3.03   0.002     .0379238    .1762571
      meatex |   .0102234   .0020359     5.02   0.000      .006233    .0142138
       _cons |   41.18072    17.0543     2.41   0.016     7.754909    74.60652
------------------------------------------------------------------------------
Endogenous: pchick
Exogenous:  y pop cpi pbeef meatex pf

. 
. ivregress 2sls q (pchick = pf pcor) y pop cpi pbeef meatex

Instrumental-variables 2SLS regression            Number of obs   =         40
                                                  Wald chi2(6)    =    3640.53
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.9891
                                                  Root MSE        =     1.0201

------------------------------------------------------------------------------
           q | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      pchick |  -.3023323   .0632226    -4.78   0.000    -.4262464   -.1784182
           y |   .0030526   .0007629     4.00   0.000     .0015574    .0045478
         pop |  -.2723013   .1259066    -2.16   0.031    -.5190737   -.0255289
         cpi |   .1646337   .0385293     4.27   0.000     .0891178    .2401497
       pbeef |   .1164736   .0363745     3.20   0.001     .0451809    .1877662
      meatex |   .0110165   .0020725     5.32   0.000     .0069544    .0150786
       _cons |   47.34058   17.41819     2.72   0.007     13.20155    81.47961
------------------------------------------------------------------------------
Endogenous: pchick
Exogenous:  y pop cpi pbeef meatex pf pcor

. 
. // lets do it ourself
. 
. * first stage 
. reg pchick pcor pf y pop cpi meatex pbeef

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(7, 32)        =    786.32
       Model |  56813.4051         7  8116.20073   Prob > F        =    0.0000
    Residual |  330.295568        32  10.3217365   R-squared       =    0.9942
-------------+----------------------------------   Adj R-squared   =    0.9930
       Total |  57143.7007        39  1465.22309   Root MSE        =    3.2127

------------------------------------------------------------------------------
      pchick | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        pcor |   .0671533   .0504852     1.33   0.193    -.0356816    .1699883
          pf |   .1125742   .0694675     1.62   0.115    -.0289265    .2540748
           y |   .0110122   .0015883     6.93   0.000      .007777    .0142474
         pop |  -1.807652   .3130586    -5.77   0.000    -2.445331   -1.169972
         cpi |   .4754373    .111081     4.28   0.000     .2491728    .7017019
      meatex |   .0317445   .0042032     7.55   0.000     .0231829    .0403061
       pbeef |   .1150574   .1041518     1.10   0.278    -.0970929    .3272077
       _cons |   249.7408   43.19733     5.78   0.000     161.7507    337.7309
------------------------------------------------------------------------------

. predict xhat, xb

. * Second stage regression
. reg q xhat y pop cpi pbeef meatex

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(6, 33)        =    612.52
       Model |  3788.67132         6   631.44522   Prob > F        =    0.0000
    Residual |  34.0197262        33  1.03090079   R-squared       =    0.9911
-------------+----------------------------------   Adj R-squared   =    0.9895
       Total |  3822.69105        39  98.0177191   Root MSE        =    1.0153

------------------------------------------------------------------------------
           q | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        xhat |  -.3023322   .0629245    -4.80   0.000     -.430353   -.1743114
           y |   .0030526   .0007593     4.02   0.000     .0015078    .0045974
         pop |  -.2723012   .1253129    -2.17   0.037    -.5272521   -.0173503
         cpi |   .1646337   .0383476     4.29   0.000      .086615    .2426524
       pbeef |   .1164735   .0362029     3.22   0.003     .0428181    .1901289
      meatex |   .0110165   .0020628     5.34   0.000     .0068198    .0152132
       _cons |   47.34056   17.33605     2.73   0.010      12.0701    82.61102
------------------------------------------------------------------------------

. 
. * multiple endogenous regressors: what if PBEEF is also endogenuous?\
. 
. // FS:
. 
. reg pbeef  pcor pf y pop cpi meatex pchick 

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(7, 32)        =    300.02
       Model |  60153.5311         7  8593.36159   Prob > F        =    0.0000
    Residual |  916.567518        32   28.642735   R-squared       =    0.9850
-------------+----------------------------------   Adj R-squared   =    0.9817
       Total |  61070.0986        39  1565.89997   Root MSE        =    5.3519

------------------------------------------------------------------------------
       pbeef | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        pcor |   .0204494   .0863178     0.24   0.814    -.1553742     .196273
          pf |   .0448257   .1201147     0.37   0.711    -.1998401    .2894914
           y |  -.0030638   .0041501    -0.74   0.466    -.0115172    .0053896
         pop |   .7425937    .733549     1.01   0.319    -.7515967    2.236784
         cpi |   .5440511     .21117     2.58   0.015      .113912    .9741902
      meatex |  -.0235172   .0109147    -2.15   0.039    -.0457496   -.0012848
      pchick |   .3192833   .2890204     1.10   0.278     -.269432    .9079987
       _cons |  -109.3763   101.0593    -1.08   0.287    -315.2274    96.47478
------------------------------------------------------------------------------

. 
. reg pchick pcor pf y pop cpi meatex pbeef

      Source |       SS           df       MS      Number of obs   =        40
-------------+----------------------------------   F(7, 32)        =    786.32
       Model |  56813.4051         7  8116.20073   Prob > F        =    0.0000
    Residual |  330.295568        32  10.3217365   R-squared       =    0.9942
-------------+----------------------------------   Adj R-squared   =    0.9930
       Total |  57143.7007        39  1465.22309   Root MSE        =    3.2127

------------------------------------------------------------------------------
      pchick | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        pcor |   .0671533   .0504852     1.33   0.193    -.0356816    .1699883
          pf |   .1125742   .0694675     1.62   0.115    -.0289265    .2540748
           y |   .0110122   .0015883     6.93   0.000      .007777    .0142474
         pop |  -1.807652   .3130586    -5.77   0.000    -2.445331   -1.169972
         cpi |   .4754373    .111081     4.28   0.000     .2491728    .7017019
      meatex |   .0317445   .0042032     7.55   0.000     .0231829    .0403061
       pbeef |   .1150574   .1041518     1.10   0.278    -.0970929    .3272077
       _cons |   249.7408   43.19733     5.78   0.000     161.7507    337.7309
------------------------------------------------------------------------------

. 
. ivregress 2sls q (pchick pbeef = pf pcor) y pop cpi meatex

Instrumental-variables 2SLS regression            Number of obs   =         40
                                                  Wald chi2(6)    =       2.37
                                                  Prob > chi2     =     0.8822
                                                  R-squared       =          .
                                                  Root MSE        =     39.926

------------------------------------------------------------------------------
           q | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      pchick |  -5.579894   117.3692    -0.05   0.962    -235.6194    224.4596
       pbeef |   8.247095   180.7847     0.05   0.964    -346.0844    362.5786
           y |   .0573347   1.207297     0.05   0.962    -2.308924    2.423593
         pop |  -11.02885   239.2157    -0.05   0.963     -479.883    457.8253
         cpi |  -2.791876   65.75337    -0.04   0.966    -131.6661    126.0824
      meatex |   .2827072   6.041412     0.05   0.963    -11.55824    12.12366
       _cons |   1586.038   34218.73     0.05   0.963    -65481.44    68653.52
------------------------------------------------------------------------------
Endogenous: pchick pbeef
Exogenous:  y pop cpi meatex pf pcor

. 
. 
. log close 
      name:  <unnamed>
       log:  C:/Users/mshams/Dropbox/Courses/are256b-w26/log/week5_5Feb2026.log
  log type:  text
 closed on:   5 Feb 2026, 22:55:47
--------------------------------------------------------------------------------
